wangeshen/MICO/Platform/Common/Cortex-M3/STM32F2xx/MicoDriverUart.c
OSStatus MicoUartSend( mico_uart_t uart, const void* data, uint32_t size )
{
    /* Reset DMA transmission result. The result is assigned in interrupt handler */
    uart_interfaces[uart].tx_dma_result = kGeneralErr;

    MicoMcuPowerSaveConfig(false);

    uart_mapping[uart].tx_dma_stream->CR  &= ~(uint32_t) DMA_SxCR_CIRC;
    uart_mapping[uart].tx_dma_stream->NDTR = size;
    uart_mapping[uart].tx_dma_stream->M0AR = (uint32_t)data;

    USART_DMACmd( uart_mapping[uart].usart, USART_DMAReq_Tx, ENABLE );
    USART_ClearFlag( uart_mapping[uart].usart, USART_FLAG_TC );
    DMA_Cmd( uart_mapping[uart].tx_dma_stream, ENABLE );

    mico_rtos_get_semaphore( &uart_interfaces[ uart ].tx_complete, MICO_NEVER_TIMEOUT );

    while ( ( uart_mapping[ uart ].usart->SR & USART_SR_TC ) == 0 )
    {
    }

    DMA_Cmd( uart_mapping[uart].tx_dma_stream, DISABLE );
    USART_DMACmd( uart_mapping[uart].usart, USART_DMAReq_Tx, DISABLE );

    MicoMcuPowerSaveConfig(true);

    return uart_interfaces[uart].tx_dma_result;
}

OSStatus MicoUartRecv( mico_uart_t uart, void* data, uint32_t size, uint32_t timeout )
{
    if (uart_interfaces[uart].rx_buffer != NULL)
    {
        while (size != 0)
        {
            uint32_t transfer_size = MIN(uart_interfaces[uart].rx_buffer->size / 2, size);

            /* Check if ring buffer already contains the required amount of data. */
            if ( transfer_size > ring_buffer_used_space( uart_interfaces[uart].rx_buffer ) )
            {
                /* Set rx_size and wait in rx_complete semaphore until data reaches rx_size or timeout occurs */
                uart_interfaces[uart].rx_size = transfer_size;

                if ( mico_rtos_get_semaphore( &uart_interfaces[uart].rx_complete, timeout) != kNoErr )
                {
                    uart_interfaces[uart].rx_size = 0;
                    return kTimeoutErr;
                }

                /* Reset rx_size to prevent semaphore being set while nothing waits for the data */
                uart_interfaces[uart].rx_size = 0;
            }

            size -= transfer_size;

            // Grab data from the buffer
            do
            {
                uint8_t* available_data;
                uint32_t bytes_available;

                ring_buffer_get_data( uart_interfaces[uart].rx_buffer, &available_data, &bytes_available );
                bytes_available = MIN( bytes_available, transfer_size );
                memcpy( data, available_data, bytes_available );
                transfer_size -= bytes_available;
                data = ( (uint8_t*) data + bytes_available );
                ring_buffer_consume( uart_interfaces[uart].rx_buffer, bytes_available );
            } while ( transfer_size != 0 );
        }

        if ( size != 0 )
        {
            return kGeneralErr;
        }
        else
        {
            return kNoErr;
        }
    }
    else
    {
        return platform_uart_receive_bytes( uart, data, size, timeout );
    }
}

static OSStatus platform_uart_receive_bytes( mico_uart_t uart, void* data, uint32_t size, uint32_t timeout )
{
    if ( uart_interfaces[uart].rx_buffer != NULL )
    {
        uart_mapping[uart].rx_dma_stream->CR |= DMA_SxCR_CIRC;

        // Enabled individual byte interrupts so progress can be updated
        USART_ITConfig( uart_mapping[uart].usart, USART_IT_RXNE, ENABLE );
    }
    else
    {
        uart_mapping[uart].rx_dma_stream->CR &= ~(uint32_t) DMA_SxCR_CIRC;
    }

    /* Reset DMA transmission result. The result is assigned in interrupt handler */
    uart_interfaces[uart].rx_dma_result = kGeneralErr;

    uart_mapping[uart].rx_dma_stream->NDTR = size;
    uart_mapping[uart].rx_dma_stream->M0AR = (uint32_t)data;
    uart_mapping[uart].rx_dma_stream->CR  |= DMA_SxCR_EN;

    if ( timeout > 0 )
    {
        mico_rtos_get_semaphore( &uart_interfaces[uart].rx_complete, timeout );
        return uart_interfaces[uart].rx_dma_result;
    }

    return kNoErr;
}

uint32_t MicoUartGetLengthInBuffer( mico_uart_t uart )
{
    return ring_buffer_used_space( uart_interfaces[uart].rx_buffer );
}

static void thread_wakeup(void *arg)
{
  mico_uart_t uart = *(mico_uart_t *)arg;

  while(1){
    if(mico_rtos_get_semaphore(&uart_interfaces[ uart ].sem_wakeup, 1000) != kNoErr){
      gpio_irq_enable(uart_mapping[uart].pin_rx->bank, uart_mapping[uart].pin_rx->number, IRQ_TRIGGER_FALLING_EDGE, RX_PIN_WAKEUP_handler, &uart);
      MicoMcuPowerSaveConfig(true);
    }
  }
}

/******************************************************
 *            Interrupt Service Routines
 ******************************************************/

void RX_PIN_WAKEUP_handler(void *arg)
{
  (void)arg;
  mico_uart_t uart = *(mico_uart_t *)arg;

  RCC_AHB1PeriphClockCmd(uart_mapping[ uart ].pin_rx->peripheral_clock, ENABLE);
  uart_mapping[ uart ].usart_peripheral_clock_func ( uart_mapping[uart].usart_peripheral_clock,  ENABLE );
  uart_mapping[uart].rx_dma_peripheral_clock_func  ( uart_mapping[uart].rx_dma_peripheral_clock, ENABLE );
  
  gpio_irq_disable(uart_mapping[uart].pin_rx->bank, uart_mapping[uart].pin_rx->number);
  MicoMcuPowerSaveConfig(false);
  mico_rtos_set_semaphore(&uart_interfaces[uart].sem_wakeup);
}



void USART1_IRQHandler( void )
{
    // Clear all interrupts. It's safe to do so because only RXNE interrupt is enabled
    USART1->SR = (uint16_t) (USART1->SR | 0xffff);

    // Update tail
    uart_interfaces[ STM32_UART_1 ].rx_buffer->tail = uart_interfaces[ STM32_UART_1 ].rx_buffer->size - uart_mapping[ STM32_UART_1 ].rx_dma_stream->NDTR;

    // Notify thread if sufficient data are available
    if ( ( uart_interfaces[ STM32_UART_1 ].rx_size > 0 ) &&
         ( ring_buffer_used_space( uart_interfaces[ STM32_UART_1 ].rx_buffer ) >= uart_interfaces[0].rx_size ) )
    {
        mico_rtos_set_semaphore( &uart_interfaces[ STM32_UART_1 ].rx_complete );
        uart_interfaces[ STM32_UART_1 ].rx_size = 0;
    }

