wangeshen/MICO/Platform/Common/Cortex-M3/STM32F2xx/MicoDriverUart.c
    if(uart_interfaces[ STM32_UART_1 ].sem_wakeup)
      mico_rtos_set_semaphore(&uart_interfaces[ STM32_UART_1 ].sem_wakeup);
}

void USART6_IRQHandler( void )
{
    // Clear all interrupts. It's safe to do so because only RXNE interrupt is enabled
    USART6->SR = (uint16_t) (USART6->SR | 0xffff);

    // Update tail
    uart_interfaces[ STM32_UART_6 ].rx_buffer->tail = uart_interfaces[ STM32_UART_6 ].rx_buffer->size - uart_mapping[ STM32_UART_6 ].rx_dma_stream->NDTR;

    // Notify thread if sufficient data are available
    if ( ( uart_interfaces[ STM32_UART_6 ].rx_size > 0 ) &&
         ( ring_buffer_used_space( uart_interfaces[ STM32_UART_6 ].rx_buffer ) >= uart_interfaces[ STM32_UART_6 ].rx_size ) )
    {
        mico_rtos_set_semaphore( &uart_interfaces[ STM32_UART_6 ].rx_complete );
        uart_interfaces[ STM32_UART_6 ].rx_size = 0;
    }

    if(uart_interfaces[ STM32_UART_6 ].sem_wakeup)
      mico_rtos_set_semaphore(&uart_interfaces[ STM32_UART_6 ].sem_wakeup);
}

//usart1_tx_dma_irq
void DMA2_Stream7_IRQHandler( void )
{
    bool tx_complete = false;

    if ( ( DMA2->HISR & DMA_HISR_TCIF7 ) != 0 )
    {
        /* Clear interrupt */
        DMA2->HIFCR |= DMA_HISR_TCIF7;
        uart_interfaces[ STM32_UART_1 ].tx_dma_result = kNoErr;
        tx_complete = true;
    }

    /* TX DMA error */
    if ( ( DMA2->HISR & ( DMA_HISR_TEIF7 | DMA_HISR_DMEIF7 | DMA_HISR_FEIF7 ) ) != 0 )
    {
        /* Clear interrupt */
        DMA2->HIFCR |= ( DMA_HISR_TEIF7 | DMA_HISR_DMEIF7 | DMA_HISR_FEIF7 );

        if ( tx_complete == false )
        {
            uart_interfaces[ STM32_UART_1 ].tx_dma_result = kGeneralErr;
        }
    }

    /* Set semaphore regardless of result to prevent waiting thread from locking up */
    mico_rtos_set_semaphore( &uart_interfaces[ STM32_UART_1 ].tx_complete);
}

//usart6_tx_dma_irq
void DMA2_Stream6_IRQHandler( void )
{
    bool tx_complete = false;

    if ( ( DMA2->HISR & DMA_HISR_TCIF6 ) != 0 )
    {
        DMA2->HIFCR |= DMA_HISR_TCIF6;
        uart_interfaces[ STM32_UART_6 ].tx_dma_result = kNoErr;
        tx_complete = true;
    }

    /* TX DMA error */
    if ( ( DMA2->HISR & ( DMA_HISR_TEIF6 | DMA_HISR_DMEIF6 | DMA_HISR_FEIF6 ) ) != 0 )
    {
        /* Clear interrupt */
        DMA2->HIFCR |= ( DMA_HISR_TEIF6 | DMA_HISR_DMEIF6 | DMA_HISR_FEIF6 );

        if ( tx_complete == false )
        {
            uart_interfaces[ STM32_UART_6 ].tx_dma_result = kGeneralErr;
        }
    }

    mico_rtos_set_semaphore( &uart_interfaces[ STM32_UART_6 ].tx_complete );
}

//usart1_rx_dma_irq
void DMA2_Stream2_IRQHandler( void )
{
    if ( ( DMA2->LISR & DMA_LISR_TCIF2 ) != 0 )
    {
        DMA2->LIFCR |= DMA_LISR_TCIF2;
        uart_interfaces[ STM32_UART_1 ].rx_dma_result = kNoErr;
    }

    /* RX DMA error */
    if ( ( DMA2->LISR & ( DMA_LISR_TEIF2 | DMA_LISR_DMEIF2 | DMA_LISR_FEIF2 ) ) != 0 )
    {
        /* Clear interrupt */
        DMA2->LIFCR |= ( DMA_LISR_TEIF2 | DMA_LISR_DMEIF2 | DMA_LISR_FEIF2 );
        uart_interfaces[ STM32_UART_1 ].rx_dma_result = kGeneralErr;
    }

    mico_rtos_set_semaphore( &uart_interfaces[ STM32_UART_1 ].rx_complete );
}

//usart6_rx_dma_irq
void DMA2_Stream1_IRQHandler( void )
{
    if ( ( DMA2->LISR & DMA_LISR_TCIF1 ) != 0 )
    {
        DMA2->LIFCR |= DMA_LISR_TCIF1;
        uart_interfaces[ STM32_UART_6 ].rx_dma_result = kNoErr;

    }

    /* TX DMA error */
    if ( ( DMA2->LISR & ( DMA_LISR_TEIF1 | DMA_LISR_DMEIF1 | DMA_LISR_FEIF1 ) ) != 0 )
    {
        /* Clear interrupt */
        DMA2->LIFCR |= ( DMA_LISR_TEIF1 | DMA_LISR_DMEIF1 | DMA_LISR_FEIF1 );
        uart_interfaces[ STM32_UART_6 ].rx_dma_result = kGeneralErr;
    }

    mico_rtos_set_semaphore( &uart_interfaces[ STM32_UART_6 ].rx_complete );
}




